I want to bring this up again because this broke my private SQL addresses the next application. Reading `data.google_compute_network` is changing on _every_ plan. My example is just these two resources:

```
Terraform will perform the following actions:

  # data.google_compute_network.default will be read during apply
  # (config refers to values not yet known)
 <= data "google_compute_network" "default"  {
      + description            = (known after apply)
      + gateway_ipv4           = (known after apply)
      + id                     = (known after apply)
      + name                   = "default"
      + project                = "fm-analytics-staging"
      + self_link              = (known after apply)
      + subnetworks_self_links = (known after apply)
    }

  # google_compute_global_address.private_ip_address must be replaced
-/+ resource "google_compute_global_address" "private_ip_address" {
      ~ address            = "10.95.252.0" -> (known after apply)
        address_type       = "INTERNAL"
      ~ creation_timestamp = "2019-12-11T11:01:39.539-08:00" -> (known after apply)
      ~ id                 = "private-ip-address" -> (known after apply)
        name               = "private-ip-address"
      ~ network            = "https://www.googleapis.com/compute/v1/projects/fm-analytics-staging/global/networks/default" -> (known after apply) # forces replacement
        prefix_length      = 24
        project            = "fm-analytics-staging"
        purpose            = "VPC_PEERING"
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/fm-analytics-staging/global/addresses/private-ip-address" -> (known after apply)
    }
```

This will change on every apply. Is this not a bug? Am I doing something wrong?